<a href="https://colab.research.google.com/github/nurfnick/Cantrell_Jackson/blob/master/Tracy%20inv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pa
import numpy as np

In [0]:
url = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/Support-Oct18-Sept19.csv'

In [0]:
df2 = pa.read_csv(url)

In [4]:
df2

     Ticket ID  HS Customer  ... Agent interactions Customer interactions
0           35           18  ...                  1                     1
1           36           19  ...                  2                     1
2           44           20  ...                  1                     1
3           54           20  ...                  1                     1
4           55           23  ...                  1                     1
..         ...          ...  ...                ...                   ...
279       1009           18  ...                  1                     1
280       1012           18  ...                  1                     3
281       1014           18  ...                  2                     3
282       1016           18  ...                  1                     2
283       1017           18  ...                  0                     3

[284 rows x 13 columns]

In [0]:
cust18 = df2[df2['HS Customer']==18] #only ids that are 18

In [6]:
cust18

     Ticket ID  HS Customer  ... Agent interactions Customer interactions
0           35           18  ...                  1                     1
5           65           18  ...                  1                     1
6           71           18  ...                  0                     1
7           73           18  ...                  1                     1
8           75           18  ...                  1                     1
..         ...          ...  ...                ...                   ...
279       1009           18  ...                  1                     1
280       1012           18  ...                  1                     3
281       1014           18  ...                  2                     3
282       1016           18  ...                  1                     2
283       1017           18  ...                  0                     3

[121 rows x 13 columns]

In [7]:
custs = 46
for c in range(custs):
  print('cust ', str(c), ' = ', str(len(df2[df2['HS Customer']== c])))

cust  0  =  0
cust  1  =  0
cust  2  =  0
cust  3  =  0
cust  4  =  3
cust  5  =  13
cust  6  =  0
cust  7  =  0
cust  8  =  0
cust  9  =  0
cust  10  =  12
cust  11  =  0
cust  12  =  0
cust  13  =  0
cust  14  =  0
cust  15  =  19
cust  16  =  5
cust  17  =  0
cust  18  =  121
cust  19  =  10
cust  20  =  14
cust  21  =  6
cust  22  =  0
cust  23  =  1
cust  24  =  7
cust  25  =  15
cust  26  =  10
cust  27  =  0
cust  28  =  13
cust  29  =  0
cust  30  =  0
cust  31  =  0
cust  32  =  0
cust  33  =  0
cust  34  =  3
cust  35  =  0
cust  36  =  0
cust  37  =  11
cust  38  =  0
cust  39  =  1
cust  40  =  1
cust  41  =  13
cust  42  =  0
cust  43  =  0
cust  44  =  0
cust  45  =  6

In [0]:
def my_function(duplicateRowsDF):
  print(duplicaterows + " Refsnes")

In [0]:
#transpose dataframe
def tpose(df):
    np.transpose(df)

In [111]:
def rows(tpose)

                                 0  ...           187567
invoice_id                  179988  ...           223546
hs_customer                      4  ...                4
invoice_total                 1703  ...           2167.5
invoice_time            1538430074  ...       1547582637
ticket_id                   921385  ...          1254418
job_type          Special Projects  ...    Water Hauling
ticket_date             1538071304  ...       1547549375
ticket_item_type   job_description  ...  job_description
details                       1281  ...              NaN
Total                  3.07761e+09  ...      3.09661e+09

[10 rows x 187568 columns]

In [110]:





rows = tpose(df3[["invoice_id"],["invoice_total"],["ticket_id"],["job_type"]])

TypeError: ignored

In [0]:
#define which rows i want
def rows(df):
  print(tpose[0:1].append(tpose[2:3]).append(tspose[4:6]))

In [95]:
rows(df3)

TypeError: ignored

In [102]:
rows(tpose(df3))

TypeError: ignored

In [0]:
def grab(tpose, rows):
  print(tpose + " " + rows)

In [82]:
grab(transpose(df3))

                                 0  ...           187567
invoice_id                  179988  ...           223546
hs_customer                      4  ...                4
invoice_total                 1703  ...           2167.5
invoice_time            1538430074  ...       1547582637
ticket_id                   921385  ...          1254418
job_type          Special Projects  ...    Water Hauling
ticket_date             1538071304  ...       1547549375
ticket_item_type   job_description  ...  job_description
details                       1281  ...              NaN
Total                  3.07761e+09  ...      3.09661e+09

[10 rows x 187568 columns]

TypeError: ignored

In [79]:
def grab(x, y, z):
    print(grab(transpose[0:1].append(transpose[2:3].append)(transpose[4:6].append))

SyntaxError: ignored

In [0]:
def (duplicateRowsDF, y):
...     """Return x plus y"""
...     return dft  y

In [0]:
duplicateRowsDF = pa.DataFrame(tab4n[tab4n.duplicated()])
print(duplicateRowsDF)

#for each unique ticket and invoice, the type and number of job type of each customer.

In [8]:
# for customer number 4
url2 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_4.csv'
df3 = pa.read_csv(url2)
df3

        invoice_id  hs_customer  ...  ticket_item_type  details
0           179988            4  ...   job_description   1281.0
1           179987            4  ...   job_description   1281.0
2           179995            4  ...   job_description   1281.0
3           179978            4  ...   job_description   1281.0
4           180011            4  ...   job_description   1281.0
...            ...          ...  ...               ...      ...
187563      223637            4  ...   job_description      NaN
187564      223548            4  ...   job_description      NaN
187565      223544            4  ...   job_description      NaN
187566      223547            4  ...   job_description      NaN
187567      223546            4  ...   job_description      NaN

[187568 rows x 9 columns]

In [0]:
#Total sum per row: 
dude = df3.loc[:,'Total'] = df3.sum(axis=1)
dudes = pa.DataFrame(dude)

In [0]:
#df3 transposed
df3t = np.transpose(df3)

In [0]:
#df3 transposed separate rows we want
df3tl = ()
df3tl = df3t[0:1].append(df3t[2:3]).append(df3t[4:6])

In [0]:
#transpose again
df3tlt = np.transpose(df3tl)

In [0]:
#dataframe with nan values (nanas)
tab4 = pa.DataFrame(df3tlt)

In [0]:
#drop nanas
tab4n = tab4.dropna()

In [15]:
# shows duplicate rows (one instance of each)
duplicateRowsDF = pa.DataFrame(tab4n[tab4n.duplicated()])
print(duplicateRowsDF)

       invoice_id invoice_total ticket_id          job_type
1441       199546          1118   1060989  Special Projects
1442       199489        1168.4   1061138  Special Projects
1443       203162         637.6   1085710  Special Projects
1444       203167           316   1096096  Special Projects
1445       203994           324   1100343  Special Projects
...           ...           ...       ...               ...
187563     223637        5890.5   1254414     Water Hauling
187564     223548        5446.8   1254603     Water Hauling
187565     223544          1682   1254411     Water Hauling
187566     223547        2144.2   1254609     Water Hauling
187567     223546        2167.5   1254418     Water Hauling

[160093 rows x 4 columns]

In [0]:
#restrict dataframe to only show special projects
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']

In [0]:
#invoice total for job type special projects for customer 4
itspc4 = sum(spdups['invoice_total'])

In [0]:
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']

In [0]:
itwhc4 = sum(whdups['invoice_total'])

In [0]:
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc4 = sum(fbdups['invoice_total'])

In [21]:
itc4 = itspc4 + itwhc4 + itfbc4
print(f'Customer 4 spending summary: Special Projects {itspc4}, Water Hauling {itwhc4}, Flowback {itfbc4}, Total {itc4}')

Customer 4 spending summary: Special Projects 12674431.019999983, Water Hauling 1073078364.6200781, Flowback 0, Total 1085752795.640078

In [22]:
# for customer number 5
url3 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_5_p1.csv'
df5 = pa.read_csv(url3)
df5

        invoice_id  hs_customer  ...  ticket_item_type  details
0           195540            5  ...   job_description      NaN
1           195540            5  ...   job_description      NaN
2           180959            5  ...   job_description      NaN
3           180959            5  ...   job_description      NaN
4           180967            5  ...   job_description      NaN
...            ...          ...  ...               ...      ...
270885      240746            5  ...    price_per_hour      1.2
270886      240746            5  ...    price_per_hour      1.2
270887      240746            5  ...    price_per_hour      1.2
270888      240746            5  ...    price_per_hour      1.2
270889      240746            5  ...    price_per_hour      1.2

[270890 rows x 9 columns]

In [0]:
df5t = np.transpose(df5)

In [0]:
df5tl = ()
df5tl = df3t[0:1].append(df5t[2:3]).append(df5t[4:6])

In [0]:
df5tlt = np.transpose(df5tl)

In [0]:
tab5 = pa.DataFrame(df5tlt)
tab5n = tab5.dropna()

In [27]:
duplicateRowsDF = pa.DataFrame(tab5n[tab5n.duplicated()])
print(duplicateRowsDF)

       invoice_id invoice_total ticket_id       job_type
34318      193177          5460   1166078  Water Hauling
35493      199407        9690.5   1177934  Water Hauling
37516      212367           949   1206290  Water Hauling
38680      217267         221.5   1213313  Water Hauling
38716      217270           975   1230468  Water Hauling
...           ...           ...       ...            ...
185402     217954           164    943695  Water Hauling
185414     217954           164    943807  Water Hauling
185424     217954           318    944054  Water Hauling
185679     219030        6672.5    954955  Water Hauling
187556     223550            40   1015462  Water Hauling

[276 rows x 4 columns]

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc5 = sum(spdups['invoice_total'])

In [0]:
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc5 = sum(whdups['invoice_total'])

In [0]:
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc5 = sum(fbdups['invoice_total'])

In [31]:
itc5 = itspc5 + itwhc5 + itfbc5
print(f'Customer 4 spending summary: Special Projects {itspc5}, Water Hauling {itwhc5}, Flowback {itfbc5}, Total {itc5}')

Customer 4 spending summary: Special Projects 232792.0, Water Hauling 1880567.45, Flowback 451259.5, Total 2564618.95

In [32]:
# for customer number 10
url4 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_10.csv'
df6 = pa.read_csv(url4)
df6

        invoice_id  hs_customer  ...  ticket_item_type  details
0           184447           10  ...   job_description      NaN
1           184442           10  ...   job_description      NaN
2           184444           10  ...   job_description      NaN
3           181448           10  ...   job_description      NaN
4           181466           10  ...   job_description      NaN
...            ...          ...  ...               ...      ...
103330      336696           10  ...        bill_loads      1.0
103331      336699           10  ...        bill_loads      1.0
103332      336691           10  ...        bill_loads      1.0
103333      336697           10  ...        bill_loads      1.0
103334      336690           10  ...        bill_loads      1.0

[103335 rows x 9 columns]

In [0]:
df6t = np.transpose(df6)
df6tl = ()
df6tl = df6t[0:1].append(df6t[2:3]).append(df6t[4:6])
df6tlt = np.transpose(df6tl)

In [0]:
tab6 = pa.DataFrame(df6tlt)
tab6n = tab6.dropna()

In [35]:
duplicateRowsDF = pa.DataFrame(tab6n[tab6n.duplicated()])
print(duplicateRowsDF)

       invoice_id invoice_total ticket_id          job_type
6713       184410         11942    947271     Water Hauling
6714       184410         11942    947275     Water Hauling
6715       184409         16745    947278     Water Hauling
6716       184409         16745    947280     Water Hauling
6717       184410         11942    947283     Water Hauling
...           ...           ...       ...               ...
103330     336696         432.5   1916066  Special Projects
103331     336699           239   1916074  Special Projects
103332     336691         993.7   1916356  Special Projects
103333     336697         431.5   1916374  Special Projects
103334     336690          2369   1916380  Special Projects

[75940 rows x 4 columns]

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc10 = sum(spdups['invoice_total'])

In [0]:
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc10 = sum(whdups['invoice_total'])

In [0]:
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc10 = sum(fbdups['invoice_total'])

In [39]:
itc10 = itspc10 + itwhc10 + itfbc10
print(f'Customer 10 spending summary: Special Projects {itspc10}, Water Hauling {itwhc10}, Flowback {itfbc10}, Total {itc10}')

Customer 10 spending summary: Special Projects 5525745.799999991, Water Hauling 417569702.1700188, Flowback 0, Total 423095447.9700188

In [0]:
# for customer number 15
url5 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_15.csv'
df7 = pa.read_csv(url5)

In [41]:
count = df7['ticket_id'].unique,  df7['job_type'] == 'Special Projects'
sum(count[1]*1)

28363

In [42]:
count = df7['ticket_id'].unique,  df7['job_type'] == 'Water Hauling'
sum(count[1]*1)

94426

In [43]:
df7t = np.transpose(df7)
df7tl = ()
df7tl = df7t[0:1].append(df7t[2:3]).append(df7t[4:6])
df7tlt = np.transpose(df7tl)
tab7 = pa.DataFrame(df7tlt)
tab7n = tab7.dropna()
duplicateRowsDF = pa.DataFrame(tab7n[tab7n.duplicated()])
print(duplicateRowsDF)

       invoice_id invoice_total ticket_id          job_type
853        182184          1276    872658     Water Hauling
854        182184          1276    872661     Water Hauling
915        185575         24099    947345     Water Hauling
919        185564           560    947394     Water Hauling
958        195672        1272.5    966255     Water Hauling
...           ...           ...       ...               ...
122784     338055       10979.1   1938037  Special Projects
122785     338055       10979.1   1938038  Special Projects
122786     338055       10979.1   1938040  Special Projects
122787     338055       10979.1   1938042  Special Projects
122788     338055       10979.1   1938213  Special Projects

[92037 rows x 4 columns]

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc15 = sum(spdups['invoice_total'])
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc15 = sum(whdups['invoice_total'])
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc15 = sum(fbdups['invoice_total'])

In [45]:
itc15 = itspc15 + itwhc15 + itfbc15
print(f'Customer 15 spending summary: Special Projects {itspc15}, Water Hauling {itwhc15}, Flowback {itfbc15}, Total {itc15}')

Customer 15 spending summary: Special Projects 109584889.61000091, Water Hauling 360205165.6700272, Flowback 0, Total 469790055.2800281

#customer 15 has more water hauling tickets

In [46]:
# for customer number 23
url6 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_23.csv'
df8 = pa.read_csv(url6)
df8

        invoice_id  hs_customer  ...  Ticket_Item_Type  details
0           270159           23  ...   job_description    485.0
1           270159           23  ...             truck    838.0
2           270159           23  ...         bill_bbls     15.0
3           270159           23  ...        bill_hours      2.0
4           270159           23  ...         bill_type      2.0
...            ...          ...  ...               ...      ...
187480      270409           23  ...         bill_type      1.0
187481      270409           23  ...   job_description    469.0
187482      270409           23  ...             truck   1108.0
187483      270409           23  ...     price_per_bbl      0.0
187484      270409           23  ...    price_per_hour      0.0

[187485 rows x 9 columns]

In [47]:
count = df8['ticket_id'].unique,  df8['job_type'] == 'Special Projects'
sum(count[1]*1)

75939

In [48]:
df8t = np.transpose(df8)
df8tl = ()
df8tl = df8t[0:1].append(df8t[2:3]).append(df8t[4:6])
df8tlt = np.transpose(df8tl)
tab8 = pa.DataFrame(df8tlt)
tab8n = tab8.dropna()
duplicateRowsDF = pa.DataFrame(tab8n[tab8n.duplicated()])
print(duplicateRowsDF)

       invoice_id invoice_total ticket_id          job_type
1          270159        233.75   1548495  Special Projects
2          270159        233.75   1548495  Special Projects
3          270159        233.75   1548495  Special Projects
4          270159        233.75   1548495  Special Projects
5          270159        233.75   1548495  Special Projects
...           ...           ...       ...               ...
187417     270480        302.75   1548905  Special Projects
187418     270480        302.75   1548905  Special Projects
187419     270480        302.75   1548905  Special Projects
187420     270480        302.75   1548905  Special Projects
187421     270480        302.75   1548905  Special Projects

[137222 rows x 4 columns]

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc23 = sum(spdups['invoice_total'])
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc23 = sum(whdups['invoice_total'])
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc23 = sum(fbdups['invoice_total'])

In [72]:
itc23 = itspc23 + itwhc23 + itfbc23
print(f'Customer 15 spending summary: Special Projects {itspc23}, Water Hauling {itwhc23}, Flowback {itfbc23}, Total {itc23}')

Customer 15 spending summary: Special Projects 84282439.47999942, Water Hauling 103144151.50000253, Flowback 210061064.31998804, Total 397487655.29999

#customer 23 has only special projects job type tickets

In [49]:
# for customer number 28
url7 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_28.csv'
df9 = pa.read_csv(url7)
df9

        invoice_id  hs_customer  ...  ticket_item_type  details
0           179889           28  ...   job_description      NaN
1           179904           28  ...   job_description      NaN
2           179889           28  ...   job_description      NaN
3           179892           28  ...   job_description      NaN
4           179918           28  ...   job_description      NaN
...            ...          ...  ...               ...      ...
240618      337944           28  ...        bill_loads      1.0
240619      337944           28  ...        bill_loads      1.0
240620      337945           28  ...        bill_loads      1.0
240621      337945           28  ...        bill_loads      1.0
240622      337945           28  ...        bill_loads      1.0

[240623 rows x 9 columns]

In [50]:
count = df9['ticket_id'].unique,  df9['job_type'] == 'Special Projects'
sum(count[1]*1)

12666

In [51]:
count = df9['ticket_id'].unique,  df9['job_type'] == 'Water Hauling'
sum(count[1]*1)

227957

In [0]:
df8t = np.transpose(df8)
df8tl = ()
df8tl = df8t[0:1].append(df8t[2:3]).append(df8t[4:6])
df8tlt = np.transpose(df8tl)
tab8 = pa.DataFrame(df8tlt)
tab8n = tab8.dropna()
duplicateRowsDF = pa.DataFrame(tab8n[tab8n.duplicated()])
print(duplicateRowsDF)

#customer 28 has more water hauling job type tickets

In [52]:
# for customer number 34
url8 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_34.csv'
df10 = pa.read_csv(url8)
df10

        invoice_id  hs_customer  ...  Ticket_Item_Type  details
0           269968           34  ...   job_description   1383.0
1           269968           34  ...             truck   2340.0
2           269968           34  ...         bill_bbls      0.0
3           269968           34  ...        bill_hours      2.0
4           269968           34  ...         bill_type      2.0
...            ...          ...  ...               ...      ...
120552      270966           34  ...         bill_bbls    140.0
120553      270966           34  ...         bill_bbls    140.0
120554      270966           34  ...         bill_bbls    140.0
120555      270966           34  ...         bill_bbls    140.0
120556      270966           34  ...         bill_bbls    140.0

[120557 rows x 9 columns]

In [53]:
count = df10['ticket_id'].unique,  df10['job_type'] == 'Special Projects'
sum(count[1]*1)

9616

In [54]:
count = df10['ticket_id'].unique,  df10['job_type'] == 'Water Hauling'
sum(count[1]*1)

80936

#customer 34 has more water hauling job type tickets

In [55]:
# for customer number 37
url9 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_37.csv'
df11 = pa.read_csv(url9)
df11

       invoice_id  hs_customer  ...  Ticket_Item_Type  details
0          269512           37  ...         bill_type      1.0
1          269512           37  ...         bill_bbls    140.0
2          269512           37  ...   job_description   1772.0
3          269512           37  ...         bill_type      1.0
4          269512           37  ...         bill_bbls    140.0
...           ...          ...  ...               ...      ...
39237      270649           37  ...        bill_hours      0.0
39238      270649           37  ...   job_description      NaN
39239      270649           37  ...        bill_hours      3.5
39240      270649           37  ...         bill_type      2.0
39241      270649           37  ...   job_description   1866.0

[39242 rows x 9 columns]

In [56]:
count = df11['ticket_id'].unique,  df11['job_type'] == 'Flowback'
sum(count[1]*1)

17323

In [57]:
count = df11['ticket_id'].unique,  df11['job_type'] == 'Special Projects'
sum(count[1]*1)

5873

In [58]:
count = df11['ticket_id'].unique,  df11['job_type'] == 'Water Hauling'
sum(count[1]*1)

16046

#customer 37 has more flowback job type tickets

In [59]:
# for customer number 39
url10 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_39.csv'
df12 = pa.read_csv(url10)
df12

       invoice_id  hs_customer  ...  Ticket_Item_Type  details
0          270138           39  ...         bill_bbls   130.00
1          270138           39  ...     price_per_bbl     1.00
2          270138           39  ...     price_per_bbl     1.15
3          270138           39  ...         bill_type     1.00
4          270138           39  ...             truck  3325.00
...           ...          ...  ...               ...      ...
25440      270661           39  ...         bill_type     2.00
25441      270661           39  ...         bill_bbls   130.00
25442      270661           39  ...     price_per_bbl    65.00
25443      270661           39  ...     price_per_bbl    65.00
25444      270661           39  ...             truck  3333.00

[25445 rows x 9 columns]

In [60]:
count = df12['ticket_id'].unique,  df12['job_type'] == 'Water Hauling'
sum(count[1]*1)

24169

#customer 39 only has water hauling job type tickets

In [61]:
# for customer number 41
url11 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_41.csv'
df13 = pa.read_csv(url11)
df13

        invoice_id  hs_customer  ...  Ticket_Item_Type  details
0           337858           41  ...   job_description   1888.0
1           337858           41  ...   job_description   1888.0
2           337858           41  ...   job_description   1888.0
3           337858           41  ...   job_description   1888.0
4           337858           41  ...   job_description   1888.0
...            ...          ...  ...               ...      ...
156971      280103           41  ...   job_description      NaN
156972      280103           41  ...   job_description      NaN
156973      280103           41  ...   job_description      NaN
156974      280103           41  ...   job_description      NaN
156975      280103           41  ...   job_description      NaN

[156976 rows x 9 columns]

In [62]:
count = df13['ticket_id'].unique,  df13['job_type'] == 'Special Projects'
sum(count[1]*1)

11926

In [63]:
count = df13['ticket_id'].unique,  df13['job_type'] == 'Water Hauling'
sum(count[1]*1)

143380

#customer 41 has more water hauling job type tickets

In [64]:
# for customer number 45
url12 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_45.csv'
df14 = pa.read_csv(url12)
df14

      invoice_id  hs_customer  ...  Ticket_Item_Type  details
0         337854           45  ...   job_description   2011.0
1         337854           45  ...   job_description   2010.0
2         337854           45  ...     price_per_bbl  28000.0
3         337854           45  ...    price_per_hour  28000.0
4         337854           45  ...        bill_loads      1.0
...          ...          ...  ...               ...      ...
8766      322694           45  ...     price_per_bbl      5.5
8767      322694           45  ...        bill_hours      0.0
8768      322694           45  ...         bill_type      1.0
8769      322694           45  ...         bill_bbls  21519.0
8770      322694           45  ...             truck   3666.0

[8771 rows x 9 columns]

In [65]:
count = df14['ticket_id'].unique,  df14['job_type'] == 'Special Projects'
sum(count[1]*1)

8771

#customer 45 only has special projects job type tickets

In [0]:
invid = df3['invoice_id'].unique()

In [67]:
invid

array([179988, 179987, 179995, ..., 190407, 185890, 185891])

In [0]:
cust4spec = df3[df3['job_type']=='Special Projects'], df3['invoice_id'].unique, df3['ticket_id'].unique #job types that are only 'special projects'

In [69]:
cust4spec

(       invoice_id  hs_customer  ...  details         Total
 0          179988            4  ...   1281.0  3.077606e+09
 1          179987            4  ...   1281.0  3.077610e+09
 2          179995            4  ...   1281.0  3.077614e+09
 3          179978            4  ...   1281.0  3.077630e+09
 4          180011            4  ...   1281.0  3.077945e+09
 ...           ...          ...  ...      ...           ...
 10082      203980            4  ...     90.0  3.088333e+09
 10083      215099            4  ...     90.0  3.092753e+09
 10084      216904            4  ...     90.0  3.093809e+09
 10085      222358            4  ...     90.0  3.096092e+09
 10086      228546            4  ...     90.0  3.098327e+09

 [10087 rows x 10 columns], <bound method Series.unique of 0         179988
 1         179987
 2         179995
 3         179978
 4         180011
            ...
 187563    223637
 187564    223548
 187565    223544
 187566    223547
 187567    223546
 Name: invoice_id, Length: 187568, dtype: int64>, <bound method Series.unique of 0          921385
 1          921730
 2          922145
 3          922198
 4          926946
            ...
 187563    1254414
 187564    1254603
 187565    1254411
 187566    1254609
 187567    1254418
 Name: ticket_id, Length: 187568, dtype: int64>)

In [70]:
uniques = df3['invoice_id'].unique()
data = []

for var in uniques:
  data.append(df3[(df3['ticket_item_type']== "job_description" & df3['invoice_id']== var)])

TypeError: ignored

In [0]:
data

In [0]:
uniques